/*

OberEngine Decompilation

File name:
  tipmanager.h

*/

#ifndef _TIPMANAGER_H_
#define _TIPMANAGER_H_

#include "nodebase.h"

class TipManager {
  int field_4; // 0x4
  int field_8; // 0x8
  int field_C; // 0xC
  int field_10; // 0x10
  int field_14; // 0x14
  int field_18; // 0x18
  int field_1C; // 0x1C
  int field_20; // 0x20
  int field_24; // 0x24
  int field_28; // 0x28
  int field_2C; // 0x2C
  int field_30; // 0x30
  int field_34; // 0x34
  int field_38; // 0x38
  int field_3C; // 0x3C
  int field_40; // 0x40
  NodeBase* field_44; // 0x44
  NodeBase* field_48; // 0x48
  bool field_4C; // 0x4C
  bool field_4D; // 0x4D
  bool field_4E; // 0x4E
  bool field_4F; // 0x4F
};

#endif // _TIPMANAGER_H_
